{
  "dependencies": {
    "lb": ">= 0.0.0",
    "rightscale": ">= 0.0.0"
  },
  "name": "lb_elb",
  "maintainer_email": "support@rightscale.com",
  "attributes": {
  },
  "license": "Copyright RightScale, Inc. All rights reserved.",
  "suggestions": {
  },
  "platforms": {
  },
  "maintainer": "RightScale, Inc.",
  "long_description": "= RightScale AWS Elastic Load Balancer (ELB) Cookbook\n\n== DESCRIPTION:\n\nRightScale load balancer cookbook for AWS Elastic Load Balancer (ELB).\n\nThis cookbook provides recipes for attaching and detaching application servers\nto and from an existing AWS Elastic Load Balancer (ELB).\n\n== DETAILS:\n\nThe recipes in this cookbook are designed to enable an application server to attach itself to or detach itself from an existing AWS Elastic Load Balancer (ELB).\nThe name of an existing ELB is provided as an input. The application server is\nthen associated with the ELB on AWS. Administrators create ELBs using the RightScale Dashboard.\n\n== REQUIREMENTS:\n\n* Requires a virtual machine launched from a RightScale-managed RightImage\n\n* Requires an existing AWS Elastic Load Balancer\n\n== SETUP:\n\n== USAGE:\n\n=== Application Server Attach\n\n==== do_attach_request\n\nThis recipe is used by application servers to request that an AWS ELB\nattach the application server to its configuration. The recipe sends\nthe server's instance ID as a parameter to the ELB.\n\n=== Application Server Detach\n\n==== do_detach_request\n\nThis recipe is used by application servers to request that an AWS ELB\ndetach the application server from its configuration. The recipe sends\nthe server's instance ID as a parameter to the ELB.\n\n== KNOWN LIMITATIONS:\n\n= LICENSE\n\nCopyright RightScale, Inc. All rights reserved.  All access and use subject to the\nRightScale Terms of Service available at http://www.rightscale.com/terms.php and,\nif applicable, other agreements such as a RightScale Master Subscription Agreement.\n",
  "version": "0.0.1",
  "recommendations": {
  },
  "recipes": {
  },
  "groupings": {
  },
  "conflicting": {
  },
  "replacing": {
  },
  "description": "Adds application servers to ELB",
  "providing": {
  }
}