{
  "version": "13.5.1",
  "name": "lb_elb",
  "long_description": "# RightScale AWS Elastic Load Balancer (ELB) Cookbook\n\n## DESCRIPTION:\n\nThis cookbook is available at [https://github.com/rightscale/rightscale_cookbooks](https://github.com/rightscale/rightscale_cookbooks).\n\nRightScale load balancer cookbook for AWS Elastic Load Balancer (ELB).\n\nThis cookbook provides recipes for attaching and detaching application servers\nto and from an existing AWS Elastic Load Balancer (ELB).\n\n## DETAILS:\n\nThe recipes in this cookbook are designed to enable an application server to\nattach itself to or detach itself from an existing AWS Elastic Load Balancer\n(ELB). The name of an existing ELB is provided as an input. The application\nserver is then associated with the ELB on AWS. Administrators create ELBs using\nthe RightScale Dashboard.\n\n## REQUIREMENTS:\n\n* Requires a virtual machine launched from a RightScale-managed RightImage\n\n* Requires an existing AWS Elastic Load Balancer\n\n## SETUP/USAGE:\n\n### Application Server Attach\n\n#### do_attach_request\n\nThis recipe is used by application servers to request that an AWS ELB attach the\napplication server to its configuration. The recipe sends the server's instance\nID as a parameter to the ELB.\n\n### Application Server Detach\n\n#### do_detach_request\n\nThis recipe is used by application servers to request that an AWS ELB detach the\napplication server from its configuration. The recipe sends the server's\ninstance ID as a parameter to the ELB.\n\n## KNOWN LIMITATIONS:\n\nThere are no known limitations.\n\n## LICENSE\n\nCopyright RightScale, Inc. All rights reserved.\nAll access and use subject to the RightScale Terms of Service available at\nhttp://www.rightscale.com/terms.php and, if applicable, other agreements\nsuch as a RightScale Master Subscription Agreement.\n",
  "recipes": {
  },
  "conflicting": {
  },
  "recommendations": {
  },
  "dependencies": {
    "rightscale": ">= 0.0.0",
    "lb": ">= 0.0.0"
  },
  "attributes": {
  },
  "description": "RightScale load balancer cookbook for AWS Elastic Load Balancer (ELB). This cookbook provides recipes for attaching and detaching application servers to and from an existing AWS Elastic Load Balancer (ELB).",
  "providing": {
  },
  "groupings": {
  },
  "maintainer": "RightScale, Inc.",
  "suggestions": {
  },
  "license": "Copyright RightScale, Inc. All rights reserved.",
  "maintainer_email": "support@rightscale.com",
  "replacing": {
  },
  "platforms": {
    "ubuntu": ">= 0.0.0",
    "centos": ">= 0.0.0",
    "redhat": ">= 0.0.0"
  }
}